In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([i for i in range(1, 11, 2)]) # start, end, step
print(type(s1))
print(s1)

<class 'pandas.core.series.Series'>
0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
s1 = pd.Series([1,2,np.nan,7,9]) # 결측치의 추가
print(type(s1))
print(s1)

<class 'pandas.core.series.Series'>
0    1.0
1    2.0
2    NaN
3    7.0
4    9.0
dtype: float64

In [4]:
df = pd.DataFrame([[i+1,i+2]for i in range(10)]) #0 ~ 9
df

    0   1
0   1   2
1   2   3
2   3   4
3   4   5
4   5   6
5   6   7
6   7   8
7   8   9
8   9  10
9  10  11

In [5]:
df.columns = ['a','b']
df

    a   b
0   1   2
1   2   3
2   3   4
3   4   5
4   5   6
5   6   7
6   7   8
7   8   9
8   9  10
9  10  11

In [6]:
df.index == 0 #index가 0이면 true

array([ True, False, False, False, False, False, False, False, False,
       False])

In [7]:
df[[ True, False, False, False, False, False, False, False, False,
       False]] #True인 관측치만 출력

   a  b
0  1  2

In [8]:
df[df.index==0]

   a  b
0  1  2

In [11]:
df[df.index >= 5]

    a   b
5   6   7
6   7   8
7   8   9
8   9  10
9  10  11

In [12]:
#df.index >= 2 & df.index <= 3 #X
(df.index >= 2) & (df.index <= 3)

array([False, False,  True,  True, False, False, False, False, False,
       False])

In [13]:
df[(df.index >= 2) & (df.index <= 3)]

   a  b
2  3  4
3  4  5

In [14]:
df.head() #front 5

   a  b
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6

In [15]:
df.head(3)

   a  b
0  1  2
1  2  3
2  3  4

In [16]:
df.tail() #last 5

    a   b
5   6   7
6   7   8
7   8   9
8   9  10
9  10  11

In [17]:
df.tail(3) #last3

    a   b
7   8   9
8   9  10
9  10  11

In [18]:
print(df.index)

RangeIndex(start=0, stop=10, step=1)

In [21]:
df = pd.DataFrame([[1,2],[np.NaN, 4],[5,np.NaN]])
df

     0    1
0  1.0  2.0
1  NaN  4.0
2  5.0  NaN

In [22]:
df2 = df * 2  # NaN은 연산 안됨
df2

      0    1
0   2.0  4.0
1   NaN  8.0
2  10.0  NaN

In [23]:
df3 = df2.dropna()
df3

     0    1
0  2.0  4.0

In [24]:
df3 = df2.fillna(0)
df3

      0    1
0   2.0  4.0
1   0.0  8.0
2  10.0  0.0

In [25]:
df3.columns = ['A','B']
df3

      A    B
0   2.0  4.0
1   0.0  8.0
2  10.0  0.0

In [26]:
#파생변수 'C'추가
df3['C'] = df3['A'] + df3['B'] / 2
df3

      A    B     C
0   2.0  4.0   4.0
1   0.0  8.0   4.0
2  10.0  0.0  10.0

In [27]:
df3 = df3.drop('C',axis=1)
df3

      A    B
0   2.0  4.0
1   0.0  8.0
2  10.0  0.0

In [28]:
#파생변수 'C'추가
df3['C'] = df3['A'] + df3['B'] / 2
df3

      A    B     C
0   2.0  4.0   4.0
1   0.0  8.0   4.0
2  10.0  0.0  10.0

In [29]:
df4 = pd.DataFrame([[20, 30, 25, 1000]], columns=['A', 'B', 'C', 'D'])
df4

    A   B   C     D
0  20  30  25  1000

In [30]:
pd.concat([df3,df4])

      A     B     C       D
0   2.0   4.0   4.0     NaN
1   0.0   8.0   4.0     NaN
2  10.0   0.0  10.0     NaN
0  20.0  30.0  25.0  1000.0

In [31]:
df5 = pd.concat([df3,df4]) #DataFrame 결합, index 정리 필요
df5

      A     B     C       D
0   2.0   4.0   4.0     NaN
1   0.0   8.0   4.0     NaN
2  10.0   0.0  10.0     NaN
0  20.0  30.0  25.0  1000.0

In [32]:
df6 = df5.reset_index(drop=True)
df6

      A     B     C       D
0   2.0   4.0   4.0     NaN
1   0.0   8.0   4.0     NaN
2  10.0   0.0  10.0     NaN
3  20.0  30.0  25.0  1000.0

In [33]:
df6 = df6.drop(3,axis=0)
df6

      A    B     C   D
0   2.0  4.0   4.0 NaN
1   0.0  8.0   4.0 NaN
2  10.0  0.0  10.0 NaN

In [35]:
df6 = df6.drop('D',axis=1)
df6

      A    B     C
0   2.0  4.0   4.0
1   0.0  8.0   4.0
2  10.0  0.0  10.0

In [38]:
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df

   a  b
0  1  2
1  3  4

In [39]:
df2.loc[0,'a']=1000
df

   a  b
0  1  2
1  3  4

In [40]:
df2

      0    1       a
0   2.0  4.0  1000.0
1   NaN  8.0     NaN
2  10.0  NaN     NaN

In [41]:
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df

   a  b
0  1  2
1  3  4

In [42]:
df2 = df.copy()
df2

   a  b
0  1  2
1  3  4

In [43]:
df2.loc[0,'a'] = 2000
df2

      a  b
0  2000  2
1     3  4

In [44]:
df

   a  b
0  1  2
1  3  4

In [48]:
df = pd.DataFrame([[1,2],[3,4],[5,6]],columns=['a','b'])
df

   a  b
0  1  2
1  3  4
2  5  6

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

In [52]:
df.sort_values(by='a',ascending=False) #a 변수 내림 차순

   a  b
2  5  6
1  3  4
0  1  2

In [53]:
df['a'].isin([1,3])

0     True
1     True
2    False
Name: a, dtype: bool

In [54]:
df[df['a'].isin([1,3])]

   a  b
0  1  2
1  3  4